import React from "react";

const About = () => (
  <section id="about" className="about-section">
    <h2 className="about-title">О НАС</h2>
    <div className="about-content">
      <div className="about-item">
        <h3 className="about-subtitle">🥁 ИГРА НА УДАРНОЙ УСТАНОВКЕ ДЛЯ ДЕТЕЙ И ВЗРОСЛЫХ</h3>
        <p>
          Привет! Меня зовут Богдан. Я обучаю игре на барабанах с нуля, помогая каждому ученику — от юных мечтателей до взрослых, решивших освоить новый навык, — раскрыть свой музыкальный потенциал.
        </p>
      </div>
      <div className="about-item">
        <h3 className="about-subtitle">🎶 ПОЗНАЙ МУЗЫКУ ЧЕРЕЗ РИТМ</h3>
        <p>
          Ритм — это сердце музыки, и я научу тебя чувствовать его. Моя цель — не просто показать, как держать палочки, а помочь тебе понять музыку на новом уровне. Мы разберём основы, разовьём координацию, чувство темпа и уверенность за ударной установкой. Каждый урок — это шаг к твоей цели, будь то игра в группе, запись треков или просто радость от любимого хобби.
        </p>
      </div>
      <div className="about-item">
        <h3 className="about-subtitle">📷 РАЗБИРАЕМ И ЗАПИСЫВАЕМ <br></br>ТВОИ ЛЮБИМЫЕ ТРЕКИ</h3>
        <p>
          Любишь рок, металл, джаз или поп? Мы разберём твои любимые песни, выучим партии и, если захочешь, запишем твою игру! Я подбираю материал под твои музыкальные вкусы, чтобы обучение было увлекательным и мотивирующим. От простых ритмов до сложных сбивок — ты научишься играть то, что вдохновляет именно тебя.
        </p>
      </div>
    </div>
  </section>
);

export default About;